Documents/РаспределениеТепловойЕнергии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>РаспределениеТепловойЕнергии</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РаспределениеТепловойЕнергии</xr:Item>
				<xr:Item>AccumulationRegister.РасчетПоказанийПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.ПоказанияПриборовУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подъезд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подъезды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеОбщедомовое</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаИндивидуальная</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщедомовойПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчетПрибораУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеМЗК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторПоследнегоИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоГКал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеИТП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеГенераторна</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДосчитаноДоКонцаМесяца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопПриборУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриборУчета2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СреднееЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственныйВладелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЛицевогоСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Энергоемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗБП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТЕ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВРО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Qдон</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Небаланс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтапливаемаПлощадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РасчетПоказанийПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетПоказанийПриборовУчета</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КорректировкаПоказаний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Энергоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ПлощадьОбъектовЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПлощадьОбъектовЛицевыхСчетов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлощадьЗданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПлощадьЗданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/РаспределениеТепловойЕнергии/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура ЗаполнитьНаСервере()
//
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	РасчитыватьЭнергоемкость = Объект.Услуга.РасчитыватьЭнергоемкость;
	
	Если ЗначениеЗаполнено(Объект.УслугаИндивидуальная) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	РасчетПоказанийПриборовУчета.ОбъектУстановки КАК ЛицевойСчет,
			|	СУММА(РасчетПоказанийПриборовУчета.Значение) КАК Значение,
			|	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь КАК ЗначениеБазы,
			|	ЕСТЬNULL(НазначенныеУслугиСрезПоследних.Период, &ПериодКон) КАК Период,
			|	ЕСТЬNULL(НазначенныеУслугиСрезПоследних.Действует, ЛОЖЬ) КАК Действует
			|ИЗ
			|	РегистрНакопления.РасчетПоказанийПриборовУчета КАК РасчетПоказанийПриборовУчета
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(&ПериодКон, ВидПлощади = &ВидБазыРаспределения) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних
			|		ПО РасчетПоказанийПриборовУчета.ОбъектУстановки.ОбъектЛицевогоСчета = ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НазначенныеУслуги.СрезПоследних(&ПериодКон, Услуга = &Услуга) КАК НазначенныеУслугиСрезПоследних
			|		ПО РасчетПоказанийПриборовУчета.ОбъектУстановки = НазначенныеУслугиСрезПоследних.ЛицевойСчет
			|ГДЕ
			|	РасчетПоказанийПриборовУчета.ОбъектУстановки.Владелец = &Здание
			|	И РасчетПоказанийПриборовУчета.Период МЕЖДУ &ПериодНач И &ПериодКон
			|	И РасчетПоказанийПриборовУчета.ОбъектУстановки.ВРО = ИСТИНА
			|	И РасчетПоказанийПриборовУчета.Услуга = &Услуга
			|
			|СГРУППИРОВАТЬ ПО
			|	РасчетПоказанийПриборовУчета.ОбъектУстановки,
			|	ЕСТЬNULL(НазначенныеУслугиСрезПоследних.Период, &ПериодКон),
			|	ЕСТЬNULL(НазначенныеУслугиСрезПоследних.Действует, ЛОЖЬ),
			|	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь";
			
		Запрос.УстановитьПараметр("ПериодНач",	НачалоМесяца(Объект.ПериодНачисления));		
		Запрос.УстановитьПараметр("ПериодКон",	КонецМесяца(Объект.ПериодНачисления));		
		Запрос.УстановитьПараметр("Услуга", 	Объект.УслугаИндивидуальная);
		Запрос.УстановитьПараметр("Здание",     Объект.Здание);
		Запрос.УстановитьПараметр("ВидБазыРаспределения", Объект.Услуга.БазаРаспределенияРасчетнойУслуги);
		
		ТаблицаУслугСоСчетчиками = Запрос.Выполнить().Выгрузить();
		
		ТаблицаУслугСоСчетчиками.Колонки.Добавить("Дней", Новый ОписаниеТипов("Число"));
		ЗначениеСоСчетчиками = ТаблицаУслугСоСчетчиками.Итог("Значение");
		МассивЛС = Новый Массив;
		Для каждого Строка  Из ТаблицаУслугСоСчетчиками Цикл
		
			Если НЕ Строка.Действует Тогда 
				
			      Строка.Дней = (НачалоМесяца(Объект.ПериодНачисления) - НачалоДня(Строка.Период))/(60*60*24);
			  Иначе
				  МассивЛС.Добавить(Строка.ЛицевойСчет);
				  Строка.Дней = 0
			
			КонецЕсли; 
		
		КонецЦикла; 
		МассивЛС = ТаблицаУслугСоСчетчиками.ВыгрузитьКолонку("ЛицевойСчет");
	Иначе
		МассивЛС = Новый Массив;
		ЗначениеСоСчетчиками = 0;		
	КонецЕсли; 	
	
	Если ТипЗнч(Объект.Услуга.БазаРаспределенияРасчетнойУслуги) = Тип("ПеречислениеСсылка.ВидыПотребителейУслуг") Тогда
		
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
			|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец КАК ОтветственныйВладелец,
			|	ВЫБОР
			|		КОГДА &ВидБазыРаспределения = ЗНАЧЕНИЕ(Перечисление.ВидыПотребителейУслуг.Прописанные)
			|			ТОГДА ЛицевыеСчетаСрезПоследних.КоличествоПрописанных
			|		ИНАЧЕ ЛицевыеСчетаСрезПоследних.КоличествоПроживающих
			|	КОНЕЦ КАК ЗначениеБазы,
			|	&Период
			|ИЗ
			|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
			|			&Период,
			|			ЛицевойСчет.Владелец = &Здание
			|				И Услуга = &Услуга
			//|				И НЕ ЛицевойСчет В (&СписокЛицевыхСчетов)
			|				И ВЫБОР
			|					КОГДА &Подъезд = ЗНАЧЕНИЕ(Справочник.Подъезды.ПустаяСсылка)
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ ЛицевойСчет.ОбъектЛицевогоСчета.Подъезд = &Подъезд
			|				КОНЕЦ) КАК НазначенныеУслугиСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Период, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицевыеСчета.СрезПоследних(&Период, ) КАК ЛицевыеСчетаСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ЛицевыеСчетаСрезПоследних.ЛицевойСчет
			|ГДЕ
			|	НазначенныеУслугиСрезПоследних.Действует = ИСТИНА
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета,
			|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
			|	ВЫБОР
			|		КОГДА &ВидБазыРаспределения = ЗНАЧЕНИЕ(Перечисление.ВидыПотребителейУслуг.Прописанные)
			|			ТОГДА ЛицевыеСчетаСрезПоследних.КоличествоПрописанных
			|		ИНАЧЕ ЛицевыеСчетаСрезПоследних.КоличествоПроживающих
			|	КОНЕЦ,
			|	НазначенныеУслугиСрезПоследних.Период
			|ИЗ
			|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
			|			&Период,
			|			ЛицевойСчет.Владелец = &Здание
			|				И Услуга = &Услуга
			//|				И НЕ ЛицевойСчет В (&СписокЛицевыхСчетов)
			|				И ВЫБОР
			|					КОГДА &Подъезд = ЗНАЧЕНИЕ(Справочник.Подъезды.ПустаяСсылка)
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ ЛицевойСчет.ОбъектЛицевогоСчета.Подъезд = &Подъезд
			|				КОНЕЦ) КАК НазначенныеУслугиСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Период, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицевыеСчета.СрезПоследних(&Период, ) КАК ЛицевыеСчетаСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ЛицевыеСчетаСрезПоследних.ЛицевойСчет
			|ГДЕ
			|	НазначенныеУслугиСрезПоследних.Действует = ЛОЖЬ
			|	И НазначенныеУслугиСрезПоследних.Период > НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)";
		
	Иначе
		
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
			|	ЕСТЬNULL(ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь, 0) КАК ЗначениеБазы,
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
			|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец КАК ОтветственныйВладелец,
			|	&Период КАК Период
			|ИЗ
			|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
			|			&Период,
			|			ЛицевойСчет.Владелец = &Здание
			|				И Услуга = &Услуга
			//|				И НЕ ЛицевойСчет В (&СписокЛицевыхСчетов)
			|				И ВЫБОР
			|					КОГДА &Подъезд = ЗНАЧЕНИЕ(Справочник.Подъезды.ПустаяСсылка)
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ ЛицевойСчет.ОбъектЛицевогоСчета.Подъезд = &Подъезд
			|				КОНЕЦ) КАК НазначенныеУслугиСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(&Период, ВидПлощади = &ВидБазыРаспределения) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета = ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Период, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
			|ГДЕ
			|	НазначенныеУслугиСрезПоследних.Действует = ИСТИНА
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
			|	ЕСТЬNULL(ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь, 0),
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета,
			|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
			|	НазначенныеУслугиСрезПоследних.Период
			|ИЗ
			|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
			|			&Период,
			|			ЛицевойСчет.Владелец = &Здание
			|				И Услуга = &Услуга
			//|				И НЕ ЛицевойСчет В (&СписокЛицевыхСчетов)
			|				И ВЫБОР
			|					КОГДА &Подъезд = ЗНАЧЕНИЕ(Справочник.Подъезды.ПустаяСсылка)
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ ЛицевойСчет.ОбъектЛицевогоСчета.Подъезд = &Подъезд
			|				КОНЕЦ) КАК НазначенныеУслугиСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(&Период, ВидПлощади = &ВидБазыРаспределения) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета = ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Период, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
			|ГДЕ
			|	НазначенныеУслугиСрезПоследних.Действует = ЛОЖЬ
			|	И НазначенныеУслугиСрезПоследних.Период > НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)";
			
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
		
	Запрос.УстановитьПараметр("Период", КонецМесяца(Объект.ПериодНачисления));		
	Запрос.УстановитьПараметр("Услуга", Объект.Услуга);		
	Запрос.УстановитьПараметр("ВидБазыРаспределения", Объект.Услуга.БазаРаспределенияРасчетнойУслуги);		
	Запрос.УстановитьПараметр("Здание", Объект.Здание);
	Запрос.УстановитьПараметр("Подъезд", Объект.Подъезд);
	//Запрос.УстановитьПараметр("СписокЛицевыхСчетов", МассивЛС);
	
	ТаблицаЛицевыхСчетов = Запрос.Выполнить().Выгрузить();
	ТаблицаЛицевыхСчетов.Колонки.Добавить("Показание", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 6)));
	ТаблицаЛицевыхСчетов.Колонки.Добавить("ПоказаниеВРО", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 6)));
	ТаблицаЛицевыхСчетов.Колонки.Добавить("ПоказаниеВКО", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 6)));
	ТаблицаЛицевыхСчетов.Колонки.Добавить("ЗначениеБазыСКоэффициентом", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 4)));
	
	Если НЕ ТаблицаУслугСоСчетчиками = Неопределено Тогда
		Для Каждого СтрокиВРО Из ТаблицаУслугСоСчетчиками Цикл
			НовСтрока = ТаблицаЛицевыхСчетов.Добавить();
			НовСтрока.ЛицевойСчет           = СтрокиВРО.ЛицевойСчет;
			НовСтрока.ЗначениеБазы          = СтрокиВРО.ЗначениеБазы;
			НовСтрока.ОбъектЛицевогоСчета   = СтрокиВРО.ЛицевойСчет.ОбъектЛицевогоСчета;
			НовСтрока.Период                = КонецМесяца(Объект.ПериодНачисления);                    //СтрокиВРО.Период;
			НовСтрока.ОтветственныйВладелец = ОбщийМодульМВК.ПолучитьПотребителя(СтрокиВРО.ЛицевойСчет);
			НовСтрока.ПоказаниеВРО          = СтрокиВРО.Значение;
		КонецЦикла;
	КонецЕсли;
	
	Для каждого Строка Из ТаблицаЛицевыхСчетов Цикл
		
		КоэффициентПоДням = День(Строка.Период)/День(Объект.ПериодНачисления);
		Строка.ЗначениеБазыСКоэффициентом  = Строка.ЗначениеБазы * КоэффициентПоДням; 
			
	КонецЦикла;
	
	ИтогБазы = ТаблицаЛицевыхСчетов.Итог("ЗначениеБазыСКоэффициентом");
	Если ИтогБазы = 0 Тогда
		Сообщить(НСтр("ru='Итог по площади равен нулю.';uk='Підсумок по площі дорівнює нулю.'"));
		Возврат;
	КонецЕсли;

	ОтапливаемаяПлощадьЗдания = ПолучитьПлощадьЗдания(Объект.Здание);
		
	ЗначениеЗБП            = Объект.ЗначениеМЗК;	
	////ЗначениеТЕБезСчетчиков = Объект.ВсегоГКал - ЗначениеЗБП - СуммаГКалЗаВРО - СуммаГКалДонараховних - СуммаГКалЗаВКО;								 
	////НаСпоживача_м2         = ЗначениеТЕБезСчетчиков / (Sобщ_дом - Sобщ_инд_от - Sобщ_вро);
	
	Для каждого Строка Из ТаблицаЛицевыхСчетов Цикл
		
		Если Строка.ЛицевойСчет.ИндОтопление Тогда
			НоваяСтрока = Объект.Основная.Добавить();
		    ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.ВидТарифа = Перечисления.ВидыТарифов.Общий;
			НоваяСтрока.ЗБП = тзДанныхДляРаспределения[0].ТЕНаЗБПм2 * Строка.ЗначениеБазы;
			НоваяСтрока.Показание = НоваяСтрока.ЗБП;
			НоваяСтрока.ОтапливаемаПлощадь = Строка.ЗначениеБазы;
		ИначеЕсли Строка.ЛицевойСчет.ВРО Тогда
			НебалансМ2 = 0;
			НоваяСтрока = Объект.Основная.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.ВидТарифа = Перечисления.ВидыТарифов.Общий;
			НоваяСтрока.ЗБП = тзДанныхДляРаспределения[0].ТЕНаЗБПм2 * Строка.ЗначениеБазы;
			
			Показания  = РасчетУслугПоТЕиГВ.КоличествоПриборовВДоме(Перечисления.МетодыУстановкиПриборовУчета.ВРО, Строка.ЛицевойСчет, Объект.ПериодНачисления)[0].Значение;
			Коэфициент = РасчетУслугПоТЕиГВ.КоличествоПриборовВДоме(Перечисления.МетодыУстановкиПриборовУчета.ВРО, Строка.ЛицевойСчет, Объект.ПериодНачисления)[0].ПриборУчетаКоэффициент;
			Если ЗначениеЗаполнено(Показания) Тогда
			    НоваяСтрока.ВРО = Показания * Коэфициент;//Строка.ПоказаниеВРО;
			Иначе
				НоваяСтрока.ВРО = 0;
			КонецЕсли;
			// Середнє питоме споживання теплової енергії на опалення приміщень 
		    q_оп = (Объект.ВсегоГКал - Объект.ЗначениеМЗК) / (Sобщ_дом - Sобщ_инд_от);
			
			// Мінімальна частка середнього питомого споживання теплової енергії 
			q_min = 0.5 * q_оп;
			Если (НоваяСтрока.ВРО / Строка.ЗначениеБазыСКоэффициентом) < q_min Тогда
			    НоваяСтрока.Qдон = (q_min - (НоваяСтрока.ВРО / Строка.ЗначениеБазыСКоэффициентом)) * Строка.ЗначениеБазыСКоэффициентом;
			КонецЕсли;
			Если Объект.ЗначениеОбщедомовое < 0 Тогда
				//РазницаНебаланс = Объект.ВсегоГКал - Объект.ЗначениеМЗК - Объект.Основная.Итог("ВРО") - Объект.Основная.Итог("Qдон") - Объект.Основная.Итог("ВКО");
				
				Небаланс = Объект.ЗначениеОбщедомовое / Sобщ_дом;
				НоваяСтрока.Небаланс = Небаланс * Строка.ЗначениеБазыСКоэффициентом;
			КонецЕсли;
			НоваяСтрока.Показание = НоваяСтрока.ЗБП + НоваяСтрока.Qдон + НоваяСтрока.ВРО + НоваяСтрока.Небаланс;
			НоваяСтрока.ОтапливаемаПлощадь = Строка.ЗначениеБазы;
		ИначеЕсли Строка.ЛицевойСчет.ВКО Тогда
			НоваяСтрока = Объект.Основная.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.ВидТарифа = Перечисления.ВидыТарифов.Общий;
			НоваяСтрока.ЗБП       = тзДанныхДляРаспределения[0].ТЕНаЗБПм2 * Строка.ЗначениеБазы;//(ЗначениеЗБП / Sобщ_дом) * Строка.ЗначениеБазы;
			// По лічильнику у квартирі вибираємо обов'язково з цієї функції (різниця у ОР)
			Показания  = РасчетУслугПоТЕиГВ.КоличествоПриборовВДоме(Перечисления.МетодыУстановкиПриборовУчета.ВКО, Строка.ЛицевойСчет, Объект.ПериодНачисления)[0].Значение;
			Коэфициент = РасчетУслугПоТЕиГВ.КоличествоПриборовВДоме(Перечисления.МетодыУстановкиПриборовУчета.ВКО, Строка.ЛицевойСчет, Объект.ПериодНачисления)[0].ПриборУчетаКоэффициент;
			Если ЗначениеЗаполнено(Показания) Тогда
			    НоваяСтрока.ВКО       = Показания * Коэфициент;
			Иначе
				НоваяСтрока.ВКО       = 0;
			КонецЕсли;
			// Середнє питоме споживання теплової енергії на опалення приміщень 
		    q_оп = (Объект.ВсегоГКал - Объект.ЗначениеМЗК) / (Sобщ_дом - Sобщ_инд_от);
			
			// Мінімальна частка середнього питомого споживання теплової енергії 
			q_min = 0.5 * q_оп;
			
			Если (НоваяСтрока.ВКО / Строка.ЗначениеБазыСКоэффициентом) < q_min Тогда
			    НоваяСтрока.Qдон = (q_min - (НоваяСтрока.ВКО / Строка.ЗначениеБазыСКоэффициентом)) * Строка.ЗначениеБазыСКоэффициентом;
			КонецЕсли;
			НоваяСтрока.Показание = НоваяСтрока.ЗБП + НоваяСтрока.Qдон + НоваяСтрока.ВКО;
			НоваяСтрока.ОтапливаемаПлощадь = Строка.ЗначениеБазы;
		Иначе
			НоваяСтрока = Объект.Основная.Добавить();
		    ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.ВидТарифа = Перечисления.ВидыТарифов.Общий;
			НоваяСтрока.ЗБП       = тзДанныхДляРаспределения[0].ТЕНаЗБПм2 * Строка.ЗначениеБазы;
			НоваяСтрока.ТЕ        = тзДанныхДляРаспределения[0].ТЕНаСпоживачаМ2 * Строка.ЗначениеБазы;
			НоваяСтрока.Показание = НоваяСтрока.ЗБП + НоваяСтрока.ТЕ;
			НоваяСтрока.ОтапливаемаПлощадь = Строка.ЗначениеБазы;
		КонецЕсли;	
	КонецЦикла;
	
	Если Объект.Основная.Итог("Показание") <> Объект.ВсегоГКал И Объект.Основная.Итог("ТЕ") = 0 Тогда
		Небаланс = (Объект.ВсегоГКал - Объект.Основная.Итог("Показание")) / Sобщ_дом;
		Для Каждого стр Из Объект.Основная Цикл
			стр.Показание = стр.Показание + (стр.ОтапливаемаПлощадь * Небаланс);			
		КонецЦикла;
	КонецЕсли;
	
	Если Объект.Основная.Итог("Показание") <> Объект.ВсегоГКал Тогда
		Небаланс = (Объект.ВсегоГКал - Объект.Основная.Итог("Показание")) / Sобщ_дом;
		Для Каждого стр Из Объект.Основная Цикл
			стр.Показание = стр.Показание + (стр.ОтапливаемаПлощадь * Небаланс);			
		КонецЦикла;
	КонецЕсли;
	
	//Если Объект.Основная.Количество()> 0 Тогда
	//    ГСЧ = Новый ГенераторСлучайныхЧисел();
	//	СЧ = ГСЧ.СлучайноеЧисло(0,  Объект.Основная.Количество() - 1);

	//	ЗначениеКорректировки = Объект.Основная.Итог("Показание") - ЗначениеДляРаспределения;	
	//    Объект.Основная[СЧ].Показание = Объект.Основная[СЧ].Показание - ЗначениеКорректировки;
	//	
	//КонецЕсли; 
	
КонецПроцедуры // ЗаполнитьНаСервере()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ПериодНачисления = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
	КонецЕсли;
	
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ОтображениеПериодаНачисления = Формат(ЭтаФорма.Объект.ПериодНачисления, НСтр(ФорматнаяСтрока));
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.Основная.Очистить();
	КонецЕсли;
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	//ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура - обработчик команды Заполнить.
//
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Основная.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед изменением периода табличная часть будет очищена. Продолжить?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.Основная.Очистить();
	КонецЕсли;
	
	ЗаполнитьНаСервере();	
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "ПериодНачисления".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияПриИзменении(Элемент)
	
	ЭтаФорма.Объект.ПериодНачисления 		= КонецМесяца(ЭтаФорма.Объект.ПериодНачисления);
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ЭтаФорма.ОтображениеПериодаНачисления 	= Формат(ЭтаФорма.Объект.ПериодНачисления, НСтр(ФорматнаяСтрока));
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "ПериодНачисления".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Основная.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед изменением периода табличная часть будет очищена. Продолжить?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.Основная.Очистить();
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("ДатаКалендаря", ?(ЭтаФорма.Объект.ПериодНачисления= Дата('00010101'), ТекущаяДата(), ЭтаФорма.Объект.ПериодНачисления));
	ДатаКалендаряНачало = ОткрытьФормуМодально("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров);
	
	ЭтаФорма.Объект.ПериодНачисления = КонецДня(ДатаКалендаряНачало);
	
	ОтображениеПериодаНачисленияПриИзменении(Элемент);
	
КонецПроцедуры

// Процедура - обработчик события Регулирование поля ввода "ПериодНачисления".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Основная.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед изменением периода табличная часть будет очищена. Продолжить?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.Основная.Очистить();
	КонецЕсли;
	

	ЭтаФорма.Объект.ПериодНачисления = ?(ЗначениеЗаполнено(ЭтаФорма.Объект.ПериодНачисления), 
						ДобавитьМесяц(ЭтаФорма.Объект.ПериодНачисления, Направление),
						ДобавитьМесяц(КонецМесяца(ТекущаяДата()), Направление));
						
	ОтображениеПериодаНачисленияПриИзменении(Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ЛицевойСчетПрибораУчетаПриИзмененииНаСервере()
	Объект.Здание = Объект.ЛицевойСчетПрибораУчета.Владелец;
	Если НЕ ЗначениеЗаполнено(Объект.Подъезд) Тогда
	    Sобщ_дом      = ПолучитьПлощадьЗдания(Объект.Здание);
	Иначе
		Sобщ_дом      = РасчетУслугПоТЕиГВ.ТаблицаЛС(Объект.ПериодНачисления, Объект.Услуга, Объект.Услуга.БазаРаспределенияРасчетнойУслуги, 
		                                             Объект.Здание, Объект.Подъезд);		                                             
	КонецЕсли;
    Если НЕ ЗначениеЗаполнено(Объект.Подъезд) Тогда
	    Sобщ_инд_от   = ОбщийМодульМВК.ВыборкаПлощадейИндОтопления(Объект.Здание);
	Иначе
		Sобщ_инд_от   = ОбщийМодульМВК.ВыборкаПлощадейИндОтопления(Объект.Здание, Объект.Подъезд);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.Подъезд) Тогда
	    Sобщ_вро      = РасчетУслугПоТЕиГВ.ВыборкаПлощадейСВРО(Объект.Здание).Итог("Площадь");
	    Sобщ_вко      = РасчетУслугПоТЕиГВ.ВыборкаПлощадейСВКО(Объект.Здание).Итог("Площадь");
	Иначе
		Sобщ_вро      = РасчетУслугПоТЕиГВ.ВыборкаПлощадейСВРО(Объект.Здание, Объект.Подъезд).Итог("Площадь");
	    Sобщ_вко      = РасчетУслугПоТЕиГВ.ВыборкаПлощадейСВКО(Объект.Здание, объект.Подъезд).Итог("Площадь");
	КонецЕсли;
	Qmax = Объект.Здание.Qmax;
	t_вн_норм = Объект.Здание.ВнутренняяТемператураЗдания;
	коеф_Z = 1 + (Sобщ_инд_от / Sобщ_дом);
	t_сер_оп_пер = Константы.t_сер_оп_пер.Получить();
	t_min_оп_пер = Константы.t_min_оп_пер.Получить();
	По_ = (Константы.ДатаОкончанияОтопительногоСезона.Получить() - Константы.ДатаНачалаОтопительногоСезона.Получить()) / 86400;
	Пр = Число(Сред(КонецМесяца(Объект.ПериодНачисления), 1, 2));	
	// Нормативне теплове навантаження будівлі/будинку, Гкал/год
	Q_буд_норм = Qmax*((t_вн_норм - t_сер_оп_пер) / (t_вн_норм - t_min_оп_пер));
	
	// Кількість теплової енергії, спожитої будівлею/будинком за опалювальний період 
	Q_буд_за_оп_пер_норм = Q_буд_норм * 24 * По_;
	
	// Фактичний обсяг спожитої у будівлі/будинку теплової енергії у розрахунковому періоді
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	СреднемесячныеПоказанияТемператур.СреднеМесячнаяТемператураФакт
	    |ИЗ
	    |	РегистрСведений.СреднемесячныеПоказанияТемператур КАК СреднемесячныеПоказанияТемператур
	    |ГДЕ
	    |	СреднемесячныеПоказанияТемператур.Месяц = &Месяц";
	Запрос.УстановитьПараметр("Месяц", Объект.ПериодНачисления);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			t_факт = Выборка.СреднеМесячнаяТемператураФакт;
		КонецЦикла;
	Иначе
		t_факт = 0;
	КонецЕсли;
	 
	Q_оп_буд = (1 - (Sобщ_инд_от/Sобщ_дом)) * Q_буд_норм * (Пр * 24) * ((t_вн_норм - t_факт) / (t_вн_норм - t_сер_оп_пер));
	
	// Норма споживання (Nбуд) теплової енергії у будівлі/будинку протягом опалювального періоду
	Nбуд = Q_буд_за_оп_пер_норм / Sобщ_дом;
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПрибораУчетаПриИзменении(Элемент)
	Если Объект.Основная.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед зміною особового рахунку таблична частина буде очищена. Продовжити?';uk='Перед зміною особового рахунку таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.Основная.Очистить();
		тзДоначисленияБезПоказанийПрибора.Очистить();
		тзДанныхДляРаспределения.Очистить();
	КонецЕсли;
	ЛицевойСчетПрибораУчетаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбщедомовойПриборУчетаПриИзменении(Элемент)
	Если Объект.Основная.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед зміною приладу обліку таблична частина буде очищена. Продовжити?';uk='Перед зміною приладу обліку таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.Основная.Очистить();
		тзДоначисленияБезПоказанийПрибора.Очистить();
		тзДанныхДляРаспределения.Очистить();
	КонецЕсли;
	ОбщедомовойПриборУчетаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьПоказания(ПриборУчета, ПериодНачисления)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	АктСнятияПоказанийТеплосчетчикаСрезПоследних.РазницаПоказания,
	    |	АктСнятияПоказанийТеплосчетчикаСрезПоследних.Период,
	    |	АктСнятияПоказанийТеплосчетчикаСрезПоследних.ЧасыПростояРазница,
	    |	АктСнятияПоказанийТеплосчетчикаСрезПоследних.РазницаЧасы КАК ЧасыРаботы
	    |ИЗ
	    |	РегистрСведений.АктСнятияПоказанийТеплосчетчика.СрезПоследних(
	    |			&ДатаСреза,
	    |			ПриборУчета = &ПриборУчета
	    |				И ПериодНачисления = &ПериодНачисления) КАК АктСнятияПоказанийТеплосчетчикаСрезПоследних";
	Запрос.УстановитьПараметр("ДатаСреза", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);
	Запрос.УстановитьПараметр("ПериодНачисления", НачалоМесяца(ПериодНачисления));
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	ДанныеВыборки = Новый Структура;
	Пока Выборка.Следующий() Цикл
		ДанныеВыборки.Вставить("КвоТЕ",       Выборка.РазницаПоказания);
		ДанныеВыборки.Вставить("ДатаСнятия",  Выборка.Период);
		ДанныеВыборки.Вставить("ЧасыПростоя", Выборка.ЧасыПростояРазница);
		ДанныеВыборки.Вставить("ЧасыРаботы",  Выборка.ЧасыРаботы);
	КонецЦикла;
	Возврат ДанныеВыборки;
КонецФункции

&НаСервере
Функция ПолучитьКвоДнейПрошлогоМесяца(ПриборУчета)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	АктСнятияПоказанийОбщедомовыхСчетчиковСрезПоследних.Период
	    |ИЗ
	    |	РегистрСведений.АктСнятияПоказанийТеплосчетчика.СрезПоследних(, ПриборУчета = &ПриборУчета) КАК АктСнятияПоказанийОбщедомовыхСчетчиковСрезПоследних
	    |ГДЕ
	    |	АктСнятияПоказанийОбщедомовыхСчетчиковСрезПоследних.Период МЕЖДУ &НачПериода И &КонПериода";
	Запрос.УстановитьПараметр("НачПериода", ДобавитьМесяц(НачалоМесяца(Объект.Дата), -2));
	Запрос.УстановитьПараметр("КонПериода", ДобавитьМесяц(КонецМесяца(Объект.Дата), -2));
	Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДатаСнятия = Выборка.Период;
	КонецЦикла;
	КоличествоДнейВМес = Число(Сред(КонецМесяца(ДатаСнятия), 1, 2));
	КвоДнейОтопления = Число(Формат(((ДатаСнятия - НачалоМесяца(ДатаСнятия)) / 86400) + 1, "ЧЦ=2"));
	КвоДней = КоличествоДнейВМес - КвоДнейОтопления;
	Возврат КвоДней;
КонецФункции

&НаСервере
Функция ПолучитьПлощадьЗдания(Здание)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ПлощадьЗданий.Площадь
	    |ИЗ
	    |	РегистрСведений.ПлощадьЗданий КАК ПлощадьЗданий
	    |ГДЕ
	    |	ПлощадьЗданий.Здание = &Здание
	    |	И ПлощадьЗданий.ВидПлощади = &ВидПлощади";
	Запрос.УстановитьПараметр("Здание", Здание);
	Запрос.УстановитьПараметр("ВидПлощади", Справочники.ВидыПлощадей.ОтапливаемаяПлощадь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Площадь = Выборка.Площадь;
	КонецЦикла;
	Возврат Площадь;
КонецФункции

&НаСервере
Функция ВремяРаботыСчетчика(ПриборУчета)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	УправлениеПриборамиУчетаПриборыУчета.ДатаОтключения,
	    |	УправлениеПриборамиУчетаПриборыУчета.ДатаВключения,
	    |	УправлениеПриборамиУчетаПриборыУчета.КонечноеПоказание
	    |ИЗ
	    |	Документ.УправлениеПриборамиУчета.ПриборыУчета КАК УправлениеПриборамиУчетаПриборыУчета
	    |ГДЕ
	    |	УправлениеПриборамиУчетаПриборыУчета.Ссылка.ВидОперации = &ВидОперации
	    |	И УправлениеПриборамиУчетаПриборыУчета.ПриборУчета = &ПриборУчета
	    |	И УправлениеПриборамиУчетаПриборыУчета.Ссылка.Проведен = ИСТИНА";
	//Запрос.УстановитьПараметр(
КонецФункции

&НаСервере
Функция ПолучитьДоначислениеПрошлогоМесяца(ПриборУчета)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	РаспределениеТепловойЕнергииСрезПоследних.ДосчитаноДоКонцаМесяца
	    |ИЗ
	    |	РегистрСведений.РаспределениеТепловойЕнергии.СрезПоследних КАК РаспределениеТепловойЕнергииСрезПоследних
	    |ГДЕ
	    |	РаспределениеТепловойЕнергииСрезПоследних.ОбщедомовойПриборУчета = &ОбщедомовойПриборУчета
	    |	И РаспределениеТепловойЕнергииСрезПоследних.Период МЕЖДУ &НачПериода И &КонПериода
	    |	И РаспределениеТепловойЕнергииСрезПоследних.Активность = ИСТИНА";
	Запрос.УстановитьПараметр("ОбщедомовойПриборУчета", ПриборУчета);
	Запрос.УстановитьПараметр("НачПериода", ДобавитьМесяц(НачалоМесяца(Объект.Дата), -1));
	Запрос.УстановитьПараметр("КонПериода", ДобавитьМесяц(КонецМесяца(Объект.Дата), -1));
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Значение = Выборка.ДосчитаноДоКонцаМесяца;
	КонецЦикла;
	Возврат Значение;
КонецФункции

&НаСервере
Функция ПолучитьПлощадьОбъектовЛицевыхСчетов(Помещение, Здание)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь
	    |ИЗ
	    |	РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(
	    |			&НаДату,
	    |			Помещение.Владелец = &Здание
	    |				И ВидПлощади = &ВидПлощади
	    |				И Помещение = &Помещение) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Объект.ПериодНачисления);
	Запрос.УстановитьПараметр("Здание", Здание);
	Запрос.УстановитьПараметр("Помещение", Помещение);
	Запрос.УстановитьПараметр("ВидПлощади", Справочники.ВидыПлощадей.ОтапливаемаяПлощадь);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ПлощадьПомещения = Выборка.Площадь;
		КонецЦикла;
		Возврат ПлощадьПомещения;
	Иначе
		ПлощадьПомещения = 0;
		Возврат ПлощадьПомещения;
	КонецЕсли;
КонецФункции

&НаСервере
Функция МЗК_ПоДоговору(ДанныеСчетчика = 0)
	//Если Месяц(Объект.ПериодНачисления) = Месяц(Константы.ДатаОкончанияОтопительногоСезона.Получить()) Тогда
		//КвоЧасовОтопления = (Константы.ДатаОкончанияОтопительногоСезона.Получить() - НачалоМесяца(Объект.ПериодНачисления)) * 24;
	//КонецЕсли;
	//Если Месяц(Объект.ПериодНачисления) = Месяц(Константы.ДатаНачалаОтопительногоСезона.Получить()) Тогда
		//КвоЧасовОтопления = КонецМесяца(Объект.ПериодНачисления)-Дата(Константы.ДатаНачалаОтопительногоСезона.Получить()) * 24;
		КвоЧасовОтопления = День(КонецМесяца(Объект.ПериодНачисления)) * 24;
	//КонецЕсли;
		
	ЕдИзмСчетчика              = Объект.ОбщедомовойПриборУчета.ЕдиницаИзмерения;
	Если ЕдИзмСчетчика = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("900") Тогда // Из ГДж
		ВсегоГКал = (ДанныеСчетчика.РазницаПоказания * 0.2388) + Объект.СреднееЗначение;
	ИначеЕсли ЕдИзмСчетчика = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("901") Тогда // Из МВт
		ВсегоГКал = (ДанныеСчетчика.РазницаПоказания * 0.8598) + Объект.СреднееЗначение;
	ИначеЕсли ЕдИзмСчетчика = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("214") Тогда // Из кВт
		ВсегоГКал = (ДанныеСчетчика.РазницаПоказания * 0.0008598) + Объект.СреднееЗначение;
	ИначеЕсли ЕдИзмСчетчика = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("245") Тогда // Из кВт
		ВсегоГКал = (ДанныеСчетчика.РазницаПоказания * 0.0008598) + Объект.СреднееЗначение;
	Иначе
		ВсегоГКал = ДанныеСчетчика.РазницаПоказания;
	КонецЕсли;
	
	Q_опал_функц_вбс = 0.00000086 * 11 * Объект.Здание.ДлиннаТрубопровода * КвоЧасовОтопления;     // (формула 23)
	
	МЗК = (ВсегоГКал * (Объект.Здание.ПлощадьМЗК / Sобщ_дом)) + Q_опал_функц_вбс;
	
	Возврат МЗК;
	
КонецФункции

&НаСервере
Процедура ОбщедомовойПриборУчетаПриИзмененииНаСервере()
    СуммаГКалЗаВРО = 0;
	СуммаГКалДонараховних = 0;
	СуммаГКалЗаВКО = 0;
	
	ДанныеСчетчика             = РасчетУслугПоТЕиГВ.ПолучитьПоказанияПрибораУчетаПоТЕ(Объект.ОбщедомовойПриборУчета, Объект.ПериодНачисления);
	ЕдИзмСчетчика              = Объект.ОбщедомовойПриборУчета.ЕдиницаИзмерения;
	КоличествоДнейТекМес       = Число(Сред(КонецМесяца(Объект.ПериодНачисления), 1, 2));
	Если Объект.Здание.НаличиеПроектаНаЗБП Тогда
		МЗК_рассчет            = МЗК_ПоДоговору(ДанныеСчетчика);
	Иначе
	    МЗК                    = Объект.Здание.МестаОбщПользования;
	КонецЕсли;
	ИТП                        = Объект.Здание.ИТП;
	Теплогенераторна           = Объект.Здание.ТеплоГенераторна;
	

	//	
	Если ЕдИзмСчетчика = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("900") Тогда // Из ГДж
		Объект.ВсегоГКал = (ДанныеСчетчика.РазницаПоказания * 0.2388) + Объект.СреднееЗначение;
	ИначеЕсли ЕдИзмСчетчика = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("901") Тогда // Из МВт
		Объект.ВсегоГКал = (ДанныеСчетчика.РазницаПоказания * 0.8598) + Объект.СреднееЗначение;
	ИначеЕсли ЕдИзмСчетчика = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("214") Тогда // Из кВт
		Объект.ВсегоГКал = (ДанныеСчетчика.РазницаПоказания * 0.0008598) + Объект.СреднееЗначение;
	ИначеЕсли ЕдИзмСчетчика = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("245") Тогда // Из кВт
		Объект.ВсегоГКал = (ДанныеСчетчика.РазницаПоказания * 0.0008598) + Объект.СреднееЗначение;
	Иначе
		Объект.ВсегоГКал = ДанныеСчетчика.РазницаПоказания;
	КонецЕсли;
	
	Если Объект.ДопПриборУчета Тогда
		ДанныеДопСчетчика             = РасчетУслугПоТЕиГВ.ПолучитьПоказанияПрибораУчетаПоТЕ(Объект.ПриборУчета2, Объект.ПериодНачисления);
		ЕдИзмСчетчика              = Объект.ПриборУчета2.ЕдиницаИзмерения;
		Если ЕдИзмСчетчика = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("900") Тогда // Из ГДж
			Объект.ВсегоГКал = Объект.ВсегоГКал + ДанныеДопСчетчика.РазницаПоказания * 0.2388;
		ИначеЕсли ЕдИзмСчетчика = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("901") Тогда // Из МВт
			Объект.ВсегоГКал = Объект.ВсегоГКал + ДанныеДопСчетчика.РазницаПоказания * 0.86;
		ИначеЕсли ЕдИзмСчетчика = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("214") Тогда // Из кВт
			Объект.ВсегоГКал = Объект.ВсегоГКал + ДанныеДопСчетчика.РазницаПоказания * 0.0008598;
		ИначеЕсли ЕдИзмСчетчика = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("245") Тогда // Из кВт
			Объект.ВсегоГКал = Объект.ВсегоГКал + ДанныеДопСчетчика.РазницаПоказания * 0.0008598;
		Иначе
			Объект.ВсегоГКал = Объект.ВсегоГКал + ДанныеДопСчетчика.РазницаПоказания;
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Подъезд) Тогда
	    КвоВРО = КоличествоПриборовВДоме(Перечисления.МетодыУстановкиПриборовУчета.ВРО, Объект.Здание);
	    КвоВКО = КоличествоПриборовВДоме(Перечисления.МетодыУстановкиПриборовУчета.ВКО, Объект.Здание);
	Иначе
        КвоВРО = КоличествоПриборовВДоме(Перечисления.МетодыУстановкиПриборовУчета.ВРО, Объект.Здание, Объект.Подъезд);
	    КвоВКО = КоличествоПриборовВДоме(Перечисления.МетодыУстановкиПриборовУчета.ВКО, Объект.Здание, Объект.Подъезд);
	КонецЕсли;
	
	Если КвоВРО.Количество() <> 0 Тогда
		СуммаГКалЗаВРО = 0;
	    СуммаГКалДонараховних = 0;
	    СуммаГКалЗаВКО = 0;
		КвоВРО.Колонки.Добавить("Q_дон");
		КвоВРО.Колонки.Добавить("ГКал");
		
		//Объект.ВсегоГКал = Объект.ВсегоГКал + КвоВРО.Итог("Значение");
		Если Объект.Здание.НаличиеПроектаНаЗБП Тогда
			Объект.ЗначениеМЗК            = МЗК_ПоДоговору(ДанныеСчетчика);
		Иначе
		    Объект.ЗначениеМЗК = (Объект.ВсегоГКал * (МЗК / 100)) * коеф_Z;
		КонецЕсли;
		
		// Середнє питоме споживання теплової енергії на опалення приміщень 
        q_оп = (Объект.ВсегоГКал - Объект.ЗначениеМЗК) / (Sобщ_дом - Sобщ_инд_от);
	
	    // Мінімальна частка середнього питомого споживання теплової енергії 
	    q_min = 0.5 * q_оп;
		Для Каждого стр Из КвоВРО Цикл
			// Донарахування до мінімального споживання теплової енергії у опалювальному приміщенні з приладом обліку
			ПлощадьКвартиры = ПолучитьПлощадьОбъектовЛицевыхСчетов(стр.ОбъектУстановки.ОбъектЛицевогоСчета, Объект.Здание);
			Если НЕ ЗначениеЗаполнено(стр.Значение) Тогда
				ПоказСчетчикаВРО = 0;
				Если (ПоказСчетчикаВРО / ПлощадьКвартиры) < q_min Тогда
					стр.Q_дон = (q_min - (ПоказСчетчикаВРО / ПлощадьКвартиры)) * ПлощадьКвартиры;
					стр.ГКал = ПоказСчетчикаВРО + стр.Q_дон;
					НовСтрока = тзДоначисленияБезПоказанийПрибора.Добавить();
					НовСтрока.ЛицевойСчет = стр.ОбъектУстановки;
					НовСтрока.ДоначислениеДоМинимального = стр.Q_дон;
					НовСтрока.ПлощадьОбъекта = ПлощадьКвартиры;
				КонецЕсли;
			Иначе
				Если стр.ПриборУчета.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("900") Тогда // Из ГДж
				    ПоказСчетчикаВРО = стр.Значение * 0.2388;
				ИначеЕсли стр.ПриборУчета.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("901") Тогда // Из МВт
				    ПоказСчетчикаВРО = стр.Значение * 0.8598;
				ИначеЕсли стр.ПриборУчета.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("214") Тогда // Из кВт
					ПоказСчетчикаВРО = стр.Значение * 0.0008598;
				ИначеЕсли стр.ПриборУчета.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("245") Тогда // Из кВт
					ПоказСчетчикаВРО = стр.Значение * 0.0008598;
				Иначе
					ПоказСчетчикаВРО = стр.Значение;
				КонецЕсли;
				Если (ПоказСчетчикаВРО / ПлощадьКвартиры) < q_min Тогда
					стр.Q_дон = (q_min - (ПоказСчетчикаВРО / ПлощадьКвартиры)) * ПлощадьКвартиры;
					стр.ГКал = ПоказСчетчикаВРО + стр.Q_дон;
				КонецЕсли;
			КонецЕсли;
			СуммаГКалЗаВРО = СуммаГКалЗаВРО + ПоказСчетчикаВРО;
		КонецЦикла;
		СуммаГКалЗаВКО = ПоказСчетчикаВРО; //КвоВРО.Итог("Значение");
		Если  СуммаГКалЗаВРО = Неопределено Тогда
			СуммаГКалЗаВРО = 0;
		КонецЕсли;
		СуммаГКалДонараховних = КвоВРО.Итог("Q_дон");
		
		Объект.ЗначениеОбщедомовое = Объект.ВсегоГКал - Объект.ЗначениеМЗК - Объект.ЗначениеИТП - Объект.ЗначениеГенераторна - СуммаГКалЗаВРО -
		                             СуммаГКалДонараховних - СуммаГКалЗаВКО;
		Если (Sобщ_дом - Sобщ_инд_от - Sобщ_вро - Sобщ_вко) <= 0 Тогда
			ПлощадьНаМ2 = 1;
		Иначе
			ПлощадьНаМ2 = Sобщ_дом - Sобщ_инд_от - Sобщ_вро - Sобщ_вко;
		КонецЕсли;
		ТЕНаСпоживачаМ2 = Объект.ЗначениеОбщедомовое / ПлощадьНаМ2;
		ТЕНаЗБПм2       = Объект.ЗначениеМЗК / Sобщ_дом;
	ИначеЕсли КвоВКО.Количество() <> 0 Тогда
		СуммаГКалЗаВРО = 0;
	    СуммаГКалДонараховних = 0;
	    СуммаГКалЗаВКО = 0;
		КвоВКО.Колонки.Добавить("Q_дон");
		КвоВКО.Колонки.Добавить("ГКал");
		//Объект.ВсегоГКал = Объект.ВсегоГКал; //КвоВКО.Итог("Значение");
		Если Объект.Здание.НаличиеПроектаНаЗБП Тогда
			Объект.ЗначениеМЗК            = МЗК_ПоДоговору(ДанныеСчетчика);
		Иначе
		    Объект.ЗначениеМЗК = (Объект.ВсегоГКал * (МЗК / 100)) * коеф_Z;
		КонецЕсли;
		// Середнє питоме споживання теплової енергії на опалення приміщень 
        q_оп = (Объект.ВсегоГКал - Объект.ЗначениеМЗК) / (Sобщ_дом - Sобщ_инд_от);
	
	    // Мінімальна частка середнього питомого споживання теплової енергії 
	    q_min = 0.5 * q_оп;
		
		
		Для Каждого стр Из КвоВКО Цикл
			// Донарахування до мінімального споживання теплової енергії у опалювальному приміщенні з приладом обліку
			ПлощадьКвартиры = ПолучитьПлощадьОбъектовЛицевыхСчетов(стр.ОбъектУстановки.ОбъектЛицевогоСчета, Объект.Здание);
				
			Если НЕ ЗначениеЗаполнено(стр.Значение) Тогда
				ПоказСчетчикаВКО = 0;
				Если (ПоказСчетчикаВКО / ПлощадьКвартиры) < q_min Тогда
					стр.Q_дон = (q_min - (ПоказСчетчикаВКО / ПлощадьКвартиры)) * ПлощадьКвартиры;
					стр.ГКал = ПоказСчетчикаВКО + стр.Q_дон;
					НовСтрока = тзДоначисленияБезПоказанийПрибора.Добавить();
					НовСтрока.ЛицевойСчет = стр.ОбъектУстановки;
					НовСтрока.ДоначислениеДоМинимального = стр.Q_дон;
					НовСтрока.ПлощадьОбъекта = ПлощадьКвартиры;
				КонецЕсли;
			Иначе
				Если стр.ПриборУчета.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("900") Тогда // Из ГДж
				    ПоказСчетчикаВКО = стр.Значение * 0.2388;
				ИначеЕсли стр.ПриборУчета.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("901") Тогда // Из МВт
				    ПоказСчетчикаВКО = стр.Значение * 0.8598;
				ИначеЕсли стр.ПриборУчета.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("214") Тогда // Из кВт
					ПоказСчетчикаВКО = стр.Значение * 0.0008598;
				ИначеЕсли стр.ПриборУчета.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("245") Тогда // Из кВт
					ПоказСчетчикаВКО = стр.Значение * 0.0008598;
				Иначе
					ПоказСчетчикаВКО = стр.Значение;
				КонецЕсли;
				Если (ПоказСчетчикаВКО / ПлощадьКвартиры) < q_min Тогда
					стр.Q_дон = (q_min - (ПоказСчетчикаВКО / ПлощадьКвартиры)) * ПлощадьКвартиры;
					стр.ГКал = ПоказСчетчикаВКО + стр.Q_дон;
				КонецЕсли;
			КонецЕсли;
			СуммаГКалЗаВКО = СуммаГКалЗаВКО + ПоказСчетчикаВКО;
		КонецЦикла;
		 //КвоВКО.Итог("Значение");
		Если СуммаГКалЗаВКО = Неопределено Тогда
			СуммаГКалЗаВКО = 0;
		КонецЕсли;
		СуммаГКалДонараховних = КвоВКО.Итог("Q_дон");
		
		Объект.ЗначениеОбщедомовое = Объект.ВсегоГКал - Объект.ЗначениеМЗК - Объект.ЗначениеИТП - Объект.ЗначениеГенераторна - СуммаГКалЗаВРО -
		                             СуммаГКалДонараховних - СуммаГКалЗаВКО;
		Если (Sобщ_дом - Sобщ_инд_от - Sобщ_вро - Sобщ_вко) <= 0 Тогда
			ПлощадьНаМ2 = 1;
		Иначе
			ПлощадьНаМ2 = Sобщ_дом - Sобщ_инд_от - Sобщ_вро - Sобщ_вко;
		КонецЕсли;
		ТЕНаСпоживачаМ2 = Объект.ЗначениеОбщедомовое / ПлощадьНаМ2;
		ТЕНаЗБПм2       = Объект.ЗначениеМЗК / Sобщ_дом;
	Иначе
	    // Максимальна частка питомого споживання теплової енергії 
		q_max = Nбуд * ((t_вн_норм - t_min_оп_пер) / (t_вн_норм - t_сер_оп_пер)) * (Пр / По_);
		
		Если Объект.Здание.НаличиеПроектаНаЗБП Тогда
			Объект.ЗначениеМЗК            = МЗК_ПоДоговору(ДанныеСчетчика);
		Иначе
		    Объект.ЗначениеМЗК = (Объект.ВсегоГКал * (МЗК / 100)) * коеф_Z;
		КонецЕсли;
		
		Объект.ЗначениеОбщедомовое = Объект.ВсегоГКал - Объект.ЗначениеМЗК - Объект.ЗначениеИТП - Объект.ЗначениеГенераторна - СуммаГКалЗаВРО -
		                             СуммаГКалДонараховних - СуммаГКалЗаВКО;
									 									 
		Если (Sобщ_дом - Sобщ_инд_от - Sобщ_вро - Sобщ_вко) <= 0 Тогда
			ПлощадьНаМ2 = 1;
		Иначе
			ПлощадьНаМ2 = Sобщ_дом - Sобщ_инд_от - Sобщ_вро - Sобщ_вко;
	    КонецЕсли;
		ТЕНаСпоживачаМ2 = Объект.ЗначениеОбщедомовое / ПлощадьНаМ2;
		ТЕНаЗБПм2       = Объект.ЗначениеМЗК / Sобщ_дом;
	КонецЕсли;
	
	
	
    Если тзДанныхДляРаспределения.Количество() = 0 Тогда
	    НовСтр                 = тзДанныхДляРаспределения.Добавить();
		НовСтр.Период          = Объект.ПериодНачисления;
		НовСтр.ТЕЗагальный     = Объект.ВсегоГКал;
		НовСтр.ТЕЗаВКО         = СуммаГКалЗаВКО;
		НовСтр.ТЕЗаВРО         = СуммаГКалЗаВРО;
		НовСтр.ТЕНаЗБП         = Объект.ЗначениеМЗК;
		НовСтр.q_max           = q_max;
		НовСтр.q_min           = q_min;
		НовСтр.q_оп            = q_оп;
		НовСтр.Q_дон           = СуммаГКалДонараховних;
		НовСтр.ТЕБезСчет       = Объект.ЗначениеОбщедомовое;
		НовСтр.ОбщПлДома       = Sобщ_дом;
		НовСтр.ОбщПлИндОтопл   = Sобщ_инд_от;
		НовСтр.ОбщПлВРО        = Sобщ_вро;
		НовСтр.ТЕНаЗБПм2       = Объект.ЗначениеМЗК / Sобщ_дом;
		НовСтр.ТЕНаСпоживачаМ2 = Объект.ЗначениеОбщедомовое / ПлощадьНаМ2;
	Иначе
		Для Каждого Стр Из тзДанныхДляРаспределения Цикл
			Стр.Период          = Объект.ПериодНачисления;
			Стр.ТЕЗагальный     = Объект.ВсегоГКал;
			Стр.ТЕЗаВКО         = СуммаГКалЗаВКО;
			Стр.ТЕЗаВРО         = СуммаГКалЗаВРО;
			Стр.ТЕНаЗБП         = Объект.ЗначениеМЗК;
			Стр.q_max           = q_max;
			Стр.q_min           = q_min;
			Стр.q_оп            = q_оп;
			Стр.Q_дон           = СуммаГКалДонараховних;
			Стр.ТЕБезСчет       = Объект.ЗначениеОбщедомовое;
			Стр.ОбщПлДома       = Sобщ_дом;
			Стр.ОбщПлИндОтопл   = Sобщ_инд_от;
			Стр.ОбщПлВРО        = Sобщ_вро;
			Стр.ТЕНаЗБПм2       = Объект.ЗначениеМЗК / Sобщ_дом;
			Стр.ТЕНаСпоживачаМ2 = Объект.ЗначениеОбщедомовое / ПлощадьНаМ2;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КоличествоПриборовВДоме(МетодУстановкиПрибора, Здание = "", Подъезд = "")
	Запрос = Новый Запрос;
	Условие = "";
	Если Здание <> "" Тогда
		Условие = " И ОбъектУстановки.Владелец = &Здание";
		Запрос.УстановитьПараметр("Здание", Здание);
	КонецЕсли;
	Если Подъезд <> "" Тогда
		Условие = Условие + " И ОбъектУстановки.ОбъектЛицевогоСчета.Подъезд = &Подъезд";
		Запрос.УстановитьПараметр("Подъезд", Подъезд);
	КонецЕсли;
	Если МетодУстановкиПрибора = Перечисления.МетодыУстановкиПриборовУчета.ВКО Тогда
		Условие = Условие + " И ПриборУчета.ВКО = ИСТИНА И ПриборУчета.ОбщедомовойСчетчик = ЛОЖЬ";
	Иначе
		Условие = Условие + " И ПриборУчета.ВРО = ИСТИНА";
	КонецЕсли;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
	    |	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки,
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ВРО,
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ВКО,
	    |	РасчетПоказанийПриборовОтопление.Значение
	    |ИЗ
	    |	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(
	    |			&НаДату,
	    |			ПриборУчета.Услуга.ВидУслуги = &ВидУслуги
	    |				И Действует = ИСТИНА
		|           " + Условие + ") КАК УстановленныеПриборыУчетаСрезПоследних
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетПоказанийПриборовОтопление КАК РасчетПоказанийПриборовОтопление
	    |		ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = РасчетПоказанийПриборовОтопление.ПриборУчета
	    |ГДЕ
	    |	РасчетПоказанийПриборовОтопление.Период МЕЖДУ &НачПериода И &КонПериода
	    |
	    |УПОРЯДОЧИТЬ ПО
	    |	РасчетПоказанийПриборовОтопление.Период УБЫВ";
	Запрос.УстановитьПараметр("НаДату", НачалоМесяца(Объект.ПериодНачисления));
	Запрос.УстановитьПараметр("ВидУслуги", Справочники.ВидыУслуг.Отопление);
	Запрос.УстановитьПараметр("НачПериода", НачалоМесяца(Объект.ПериодНачисления));
	Запрос.УстановитьПараметр("КонПериода", КонецМесяца(Объект.ПериодНачисления));
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ДопПриборУчетаПриИзменении(Элемент)
	Если Объект.ДопПриборУчета Тогда
		Элементы.ПриборУчета2.Видимость = Истина;
	Иначе
		Элементы.ПриборУчета2.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.ДопПриборУчета Тогда
		Элементы.ПриборУчета2.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

//" + Условие + "
// УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.ОбъектЛицевогоСчета.Подъезд = &Подъезд"
